In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import Series

In [3]:
from pandas import DataFrame

In [4]:
data = pd.Series(np.random.randn(9),
                index=[['a','a','a','b','b','c','c','d','d'],
                      [1,2,3,1,3,1,2,2,3]])

In [5]:
data

a  1    0.871353
   2   -0.004395
   3   -1.265172
b  1    0.547270
   3   -1.152200
c  1   -1.438971
   2   -0.583014
d  2   -0.895201
   3    1.328929
dtype: float64

In [6]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [7]:
data['b']

1    0.54727
3   -1.15220
dtype: float64

In [8]:
data['b':'c']

b  1    0.547270
   3   -1.152200
c  1   -1.438971
   2   -0.583014
dtype: float64

In [9]:
data.loc[['b','d']]

b  1    0.547270
   3   -1.152200
d  2   -0.895201
   3    1.328929
dtype: float64

In [10]:
data.loc[:,2]

a   -0.004395
c   -0.583014
d   -0.895201
dtype: float64

In [11]:
data.unstack()

          1         2         3
a  0.871353 -0.004395 -1.265172
b  0.547270       NaN -1.152200
c -1.438971 -0.583014       NaN
d       NaN -0.895201  1.328929

In [12]:
data.unstack().stack()

a  1    0.871353
   2   -0.004395
   3   -1.265172
b  1    0.547270
   3   -1.152200
c  1   -1.438971
   2   -0.583014
d  2   -0.895201
   3    1.328929
dtype: float64

In [13]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['Ohio','Ohio','Colorado'],
                            ['Green','Red','Green']])

In [14]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [15]:
frame.index.names = ['key1','key2']

In [16]:
frame.columns.names = ['state','color']

In [17]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [19]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [20]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [21]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [22]:
frame.sum(level='key2')

TypeError: sum() got an unexpected keyword argument 'level'

In [23]:
#Indexing with a DataFrameâ€™s columns

In [24]:
frame = pd.DataFrame({'a': range(7), 'b':range(7,0,-1),
                     'c' : ['one','one','one','two','two','two','two'],
                     'd': [0,1,2,0,1,2,3]})

In [25]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [26]:
frame2 = frame.set_index(['c','d'])

In [27]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [28]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [29]:
#pandas.merge

In [30]:
df3 = pd.DataFrame({'key' : ['b','b','a','c','a','a','b'],
                   'data1' : range(7)})

df4 = pd.DataFrame({'key' : ['a','b','d'],
                   'data1' : range(3)})

In [31]:
df3

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [32]:
df4

  key  data1
0   a      0
1   b      1
2   d      2

In [33]:
pd.merge(df3,df4)

  key  data1
0   b      1

In [34]:
pd.merge(df3,df4,on='key')

  key  data1_x  data1_y
0   b        0        1
1   b        1        1
2   b        6        1
3   a        2        0
4   a        4        0
5   a        5        0

In [35]:
df5 = pd.DataFrame({'lkey' : ['b','b','a','c','a','a','b'],
                   'data1' : range(7)})

df6 = pd.DataFrame({'rkey' : ['a','b','d'],
                   'data1' : range(3)})

In [36]:
df5

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [37]:
df6

  rkey  data1
0    a      0
1    b      1
2    d      2

In [38]:
pd.merge(df5,df6,left_on='lkey',right_on='rkey')

  lkey  data1_x rkey  data1_y
0    b        0    b        1
1    b        1    b        1
2    b        6    b        1
3    a        2    a        0
4    a        4    a        0
5    a        5    a        0

In [41]:
pd.merge(df5,df6,how='outer')

  lkey  data1 rkey
0    b      0    a
1    b      1    b
2    a      2    d
3    c      3  NaN
4    a      4  NaN
5    a      5  NaN
6    b      6  NaN

In [42]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','b'],
                   'data' : range(6)})

df2 = pd.DataFrame({'key':['a','b','a','b','d'],
                   'data' : range(5)})

In [44]:
df1

  key  data
0   b     0
1   b     1
2   a     2
3   c     3
4   a     4
5   b     5

In [45]:
df2

  key  data
0   a     0
1   b     1
2   a     2
3   b     3
4   d     4

In [46]:
pd.merge(df1,df2,on='key',how='left') #many-to-many merge

   key  data_x  data_y
0    b       0     1.0
1    b       0     3.0
2    b       1     1.0
3    b       1     3.0
4    a       2     0.0
5    a       2     2.0
6    c       3     NaN
7    a       4     0.0
8    a       4     2.0
9    b       5     1.0
10   b       5     3.0

In [47]:
pd.merge(df1,df2,how='inner')

  key  data
0   b     1
1   a     2

In [48]:
#Concatenating Along and Axis

In [49]:
arr = np.arange(12).reshape((3,4))

In [50]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [51]:
np.concatenate([arr,arr],axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [52]:
s1 = pd.Series([0,1],index=['a','b'])
s2 = pd.Series([2,3,4],index=['c','d','e'])
s3 = pd.Series([5,6],index=['f','g'])

In [54]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [55]:
pd.concat([s1,s2,s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [59]:
s4 = pd.concat([s1,s3])

In [60]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [61]:
#Reshaping with Hierarchical Indexing

In [62]:
data = pd.DataFrame(np.arange(6).reshape((2,3)),
                   index=pd.Index(['Ohio','Colorado'],name='state'),
                   columns=pd.Index(['one','two','three'],
                                    name='number'))

In [63]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [64]:
result = data.stack()

In [65]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [66]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [67]:
data = pd.read_csv('examples/macrodata.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'examples/macrodata.csv'

In [68]:
data.head()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [70]:
pivoted = data.pivot('date','itam','value')

TypeError: DataFrame.pivot() takes 1 positional argument but 4 were given

In [71]:
pivoted

NameError: name 'pivoted' is not defined

In [74]:
#Pivoting â€œWideâ€ to â€œLongâ€ Format

In [75]:
df = pd.DataFrame({'key' : ['foo','bar','baz'],
                  'A' : [1,2,3],
                  'B' : [4,5,6],
                  'C' : [7,8,9]})

In [76]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [77]:
melted = pd.melt(df,['key'])

In [78]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9